# ExportLayerTable Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLayerTable Properties
ExportLayerTable Class See Also
---
The ExportLayerTable type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | Count of the items contained in the collection. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Item | A copy of the ExportLayerInfo item that corresponds to the layer's ExportLayerKey. |

# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace